/*
* ------------ Problem A. Aztec Pyramid ------------
? суть задачи: есть n кубиков. Их нужно сложить друг на друга так, чтобы каждый кубик лежал либо на УСТОЙЧИВОМ кубике, либо на земле, и чтобы высота конструкции получилась наибольшей. Кубик называется устойчивым, если все его грани соприкасаются либо с землей, либо с другим кубиком. Итак, есть олин кубик: его просто ставим на землю (высота 1). Чтобы на него поставить сверху другой кубик, нужно наш первый ос четырех сторон окружить еще кубиками. Итого: 1 + 4 + 1: 6 кубиков и высота 2. Чтобы на верхний кубик положить еще один, нужно повторить с ним тоже, что делали с первым, плюс кубики в первом слое тоже окружить другими кубиками (сделать их устойчивыми). Получаем: (1 + 4) + (5 + 8) + 1: 19 (высота 3). 

? Можно все эти действия представить иначе: мы под текущую пирамиду (а выходит именно пирамида) кладем еще один слой так, чтобы нижний кубики, на которых будут стоять верхние, были устойчивыми. Размер нового слоя определяется как размер предыдущего плюс прирост. С каждым новым слоем прирост увеличивается на 4.
*/

#include <iostream>
 
using namespace std;

// ! можно сделать вот так
int solve(int n) {
    int o(1); // кубиков в основании
    int i(4); // прирост основания
    int v(1); // всего кубиков
    int h(1); // высота

    while (v < n) {
        o += i;
        i += 4;
        v += o;

        if (v <= n)
            h++;
    }

    return h;
}
// ! ----
 
int main() {
    // ...
    ios::sync_with_stdio(false);
    freopen("aztec.in", "rt", stdin);
    freopen("aztec.out", "wt", stdout);
    int n;
    cin >> n;
 
    int o(1); // основание
    int i(4); // прирост основания
    int h(0); // высота
    
    while (n && n >= o) {
        h++;
        n -= o;
        o += i;
        i += 4;
    }
 
    cout << h;
 
    return 0;
}